Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения.СтарыйРегистр.Записывать = Истина;

	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;

	Для Каждого СтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = СтрокаТовары.Номенклатура;
		Движение.Количество = СтрокаТовары.Количество;

		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Сумма = СтрокаТовары.Сумма;
	КонецЦикла;

	Если Движения.Количество() > 0 Тогда
		Движения.Записать();
	КонецЕсли;

КонецПроцедуры
