&После("ПриСозданииНаСервере")
Процедура расшА_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	расшА_ДобавитьСтраницу();

КонецПроцедуры

&НаСервере
Процедура расшА_ДобавитьСтраницу()

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Товары")));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	Поле = Элементы.Добавить("Номенклатура", Тип("ПолеФормы"), Элементы.ГруппаШапка);
	Поле.УстановитьДействие("ПриИзменении", "расшА_НоменклатураПриИзменении");

КонецПроцедуры
