Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвижения(Отказ);

КонецПроцедуры

Процедура СформироватьДвижения(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки";
	Результат = Запрос.Выполнить();

	Для Каждого СтрокаТовары Из Товары Цикл

		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.Номенклатура = СтрокаТовары.Номенклатура;
		Движение.Количество = СтрокаТовары.Количество;

	КонецЦикла;

КонецПроцедуры
